/*Даны несколько заготовленных типов. При помощи них "собран" тип Student. Соберите типы Teacher и Director из имеющихся типов. Для проверки используйте переменные в самом низу. Можно определять новые типы.

Teacher имеет идентификатор, имя, уровень скила и словарь из его курсов. В словаре курсов Teacher-а по ключу id курса лежит объект с идентификатором курса, названием и ролью учителя.

Director имеет идентификатор, имя, словарь студентов и словарь учителей. Словарь студентов по id студента содержит объект с идентификатором и именем студента. Словарь учителей по id учителя содержит объект с идентификатором, именем, уровнем и оценкой учителя*/



